Public Attributes | List of all members
API_VLNumType Struct Reference
Library Part Management
The possible values for a numeric parameter. More...
#include <APIdefs_Goodies.h>
 Public Attributes
double  | value
the value itself when no limits are defined
double  | lowerLimit
the value when one of the APIVLVal_LowerLimit or APIVLVal_LowerEqual flags is set
double  | upperLimit
the value when one of the APIVLVal_UpperLimit or APIVLVal_UpperEqual flags is set
double  | stepBeg
the start value when the APIVLVal_Step flag is set
double  | stepVal
the step value when the APIVLVal_Step flag is set
UInt32  | flags
the possible value range modifiers; only one of these can be set
GS::uchar_t  | valueDescription [API_UAddParNumDescLen]
Value descriptions for numerical values.
Detailed Description
The possible values for a numeric parameter.
Remarks
This structure contains the possible numeric values for the given parameter. For more information, see the description of the VALUES command in the Parameter Script section of the GDL Reference Manual.
Member Data Documentation
◆ flags
 API_VLNumType::flags
the possible value range modifiers; only one of these can be set
 modifier  | meaning
 APIVLVal_LowerLimit  | the value of the parameter is greater than lowerLimit
 APIVLVal_LowerEqual  | the value of the parameter is greater than or equal to lowerLimit
 APIVLVal_UpperLimit  | the value of the parameter is less than upperLimit
 APIVLVal_UpperEqual  | the value of the parameter is less than or equal to upperLimit
 APIVLVal_Step  | the value of the parameter can be equal to any value in the form of stepBeg+n*stepVal, where n ≥ 0
◆ lowerLimit
 API_VLNumType::lowerLimit
the value when one of the APIVLVal_LowerLimit or APIVLVal_LowerEqual flags is set
◆ stepBeg
 API_VLNumType::stepBeg
the start value when the APIVLVal_Step flag is set
◆ stepVal
 API_VLNumType::stepVal
the step value when the APIVLVal_Step flag is set
◆ upperLimit
 API_VLNumType::upperLimit
the value when one of the APIVLVal_UpperLimit or APIVLVal_UpperEqual flags is set
◆ value
 API_VLNumType::value
the value itself when no limits are defined
◆ valueDescription
 API_VLNumType::valueDescription
Value descriptions for numerical values.